[
  {
    "id": 1742650379066,
    "bookId": "1742647149453",
    "rate": "1",
    "message": "amazing"
  },
  {
    "id": 1742673598949,
    "bookId": "1742647149453",
    "rate": "5",
    "message": "Superb"
  },
  {
    "id": 1742673731932,
    "bookId": "1742650752259",
    "rate": "4",
    "message": "Great"
  },
  {
    "id": 1742678518867,
    "bookId": "${bookId}",
    "rate": "4",
    "message": "Memoirs of a Geisha is an American novel, and as such the attempt at West does East, especially on the complex and delicate subject of the geisha, is compelling, interesting, but also heavy-handed and ultimately ineffective (even more so in the case of the film). It is a wonderful introduction to geisha, Japanese culture, and the East for the uninitiated Western reader, and I can see why the book is popular, but I found it disappointing. For the reader already familiar with the culture, western influences are all too clear and the book comes off as a bit clunky and imperfect. I also had some problems with the general perception of the characters by readers versus the way the characters were actually portrayed in the book--Memoirs is far from the good-willed fairy tale that people assume it is. By all means, read it, but leave it open for critique and remember that a more authentic representation of eastern culture, especially in the details, will come from the east itself.\r\n\r\nA lot of my critique stems from the fact that this movie has attained such wide-spread fame and been made into a movie, to be sure. I feel like it is being perpetuated as something it is not. Even the introduction to the book (a faux translator's note) perpetuates the myth that Memoirs is an accurate, beautiful, in-depth reflection of the life of a geisha, when in truth it is no more that historical fiction and is written by an outsider. Golden has done his research and is well-educated on his subjects, and I have no problem with people reading from, taking interest in, and even learning from this book; I do, however, think it is important that readers don't conflate the American novel with Japanese reality. They aren't the same thing, no matter how much research Golden did, and if we take the book as an accurate representatio"
  },
  {
    "id": "1742811647414",
    "bookId": "${bookId}",
    "rate": "5",
    "message": "edcmekwckkcm,cmc"
  },
  {
    "id": "1742837888142",
    "bookId": "1742669970044",
    "rate": "2",
    "message": "gracious"
  },
  {
    "id": "1742838152583",
    "bookId": "1742838137855",
    "rate": "5",
    "message": "Interesting book + amazing"
  }
]